[
    {
        "name": "Daily Pennsylvanian",
        "img": "../images/partnerLogos/dp-logo.png",
        "link": "https://www.thedp.com",
        "affiliation": "vc"
    },
    {
        "name": "Afore Capital",
        "img": "../images/partnerLogos/afore capital.jpg",
        "link": "https://www.afore.vc/",
        "affiliation": "vc"
    },
    {
        "name": "Civilization Ventures",
        "img": "../images/partnerLogos/civ.jpg",
        "link": "https://www.civilizationventures.com/",
        "affiliation": "vc"
    },
    {
        "name": "Comma Capital",
        "img": "../images/partnerLogos/cc.jpg",
        "link": "https://www.linkedin.com/company/comma-capital/posts/?feedView=all",
        "affiliation": "vc"
    },
    {
        "name": "Levo",
        "img": "../images/partnerLogos/levo.jpg",
        "link": "https://www.hellolevo.com/",
        "affiliation": "startup",
        "description": "Levo is working to elevate caregiver experience and increase retention rates for health systems around the country. Through their customizable text-based surveys and practical insights, Levo helps build better company culture that encourages employees to stay while saving costs for customers. They're already partnered with several of the country's largest health provider networks, and are expanding rapidly!"
    },
    {
        "name": "S44 Automotive",
        "img": "../images/partnerLogos/s44.jpg",
        "link": "https://www.s44.team/s44-automotive",
        "affiliation": "startup",
        "description": "Our vision is to disrupt automotive retail for consumers and manufacturers by connecting the consumer buying journey with the manufacturer's supply chain through predictive analytics. Our personalization API & co-pilot solution guide shoppers in their product discovery while our predictive ordering solution helps manufacturers stock the right cars at the right dealer, at the right time. In partnership with two leading OEMs in North America, our solutions are already driving multiple sales & production processes and have yielded double digit lifts for several marketing & sales KPIs."
    },
    {
        "name": "Venture Camp",
        "img": "../images/partnerLogos/vc.png",
        "link": "https://www.venturecamp.org/",
        "affiliation": "startup",
        "description": "Founded by M&T graduate Ben Hsu after raising over 10 million dollars from Kleiner Perkins for his previous startup, Venture Camp aims to build the next generation of entrepreunerial talent through startup bootcamps. With multiple successful past camps and several internal technical projects running, as well as mentorship from Open AI and Google engineers, tech interns at Venture Camp are able to work on exciting projects udner great mentorship."
    }
]