[
    {
        "category": "UA New Student Rep",
        "people": [
            {
                "name": "Julia Axler",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:jaxler@sas.upenn.edu",
                "introduction": "Hello! My name is Julia Axler, and I'm so excited to be running for Undergraduate Assembly. I’m originally from Philly (GO BIRDS!), and I’m majoring in Classics and Philosophy in the College of Arts and Sciences. I also plan to go to law school after graduating. Being part of the Penn community means so much to me, and I want to ensure every Penn student has an incredible four years! Every student deserves a voice and opportunity to shape their college experience. As a member of the UA, I’m committed to making Penn more inclusive, engaging, and supportive for everyone. ",
                "platform_points": [
                    "Improving Dining– I plan to promote more variety in dining hall food, as well as increased availability on weekends. I want to ensure students have more options regarding food and times they eat.",
                    "Increasing Printing Availability Across Undergraduate Schools- College and Nursing students deserve access to free printing! Wharton and Engineering students should have more flexibility in their printing systems. ",
                    "Improving Pottruck– Pottruck needs to expand its equipment selection. Old equipment must be updated! In addition, I will assist in an exercise catalog for Pottruck, including details on exercise equipment.",
                    "Increasing Access for Testing for Students with Special Accommodations– I will work with the UA and the Weingarten Center to reduce the logistical and financial burden that seeking accommodations creates.",
                    "Increasing Funds for Clubs– Cultural clubs, art clubs, and SCUE received budget cuts last year. I will ensure every club is treated equitably and is properly funded.",
                    "Increasing Connection to the Office of Fraternity and Sorority Life– The UA must maintain a connection with OFSL. Both organizations should make information about Greek life more accessible to students. "
                ]
            },
            {
                "name": "Gary Gao",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:garygao@sas.upenn.edu",
                "introduction": "Hello everyone, I’m Gary Gao, and I’m running for the Undergraduate Assembly(UA), the funding wing of Penn. I firmly believe in the fact that a comfortable living and learning environment should not come with hidden costs. Things like Penn Pay for printing or buying textbooks or subscriptions for class frustrates me. As your representative in the UA, I will promise concrete actionable steps, including free and accessible printers, fridges/snacks, and water dispensers in all 6 residential halls, to make your academic and residential life better - step by step. ",
                "platform_points": [
                    "Free and accessible printing on every floor across all 6 residential halls. ",
                    "Purified and filtered water dispensers on every floor in all 6 residential halls. ",
                    "IFree communal refrigerators for all freshmans. ",
                    "Light snacks for all freshmans across all 6 residential halls.",
                    "Better cleaning and maintenance of hallways, lounges, and bathrooms. ",
                    "Reimbursement for costs related to textbooks and educational subscriptions. "
                ]
            },
            {
                "name": "Maxwell Robinson",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:maxrob@sas.upenn.edu",
                "introduction": "Hello! My name is Max Robinson, and I’m running to be your Undergraduate Assembly New Student Representative and Class Board Internal Vice President. I’m originally from London, but now live in New York. It’s been so great meeting so many of you and can’t wait to meet everyone else! As my high school's Executive Board Vice President, I led initiatives like installing solar panels on my school, hosting a TEDx conference, and creating permanent diversity, philanthropy, and advocacy boards. If elected, I’ll bring big, lasting changes here, just like I did before. I hope to earn your vote! Thank you!",
                "platform_points": [
                    "I’m here to support you and your ideas. While I have my own, your voice comes first. I promise to listen, ensuring your wishes shape the change we bring together.",
                    "Last year, I led efforts to bring my high school’s first-ever Class Gift. I’ll work to leave one of the most significant gifts ever, creating a lasting legacy for us.",
                    "At my high school, I worked successfully with students, administration, and the broader community to drive change. I’ll foster the same cooperation here to create meaningful, lasting impact for everyone.",
                    "I successfully brought over 100 solar panels to my high school. I’ll leverage those connections to bring similar sustainability initiatives to Penn, helping make our campus greener and more sustainable.",
                    "I established permanent diversity, philanthropy, and outreach boards at my high school. I promise to create similar boards here, ensuring they positively impact Penn, just as they transformed my school.",
                    "I brought food trucks, celebrity DJs, and innovative events to my school. I love having fun, and would be so happy to bring exciting, new, and inclusive events for everyone."
                ]
            },
            {
                "name": "Edward Mukalazi",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:eddiemuk@sas.upenn.edu"
            },
            {
                "name": "Taya Allardice",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:alltaya@sas.upenn.edu",
                "introduction": "I’m Taya (hopefully your next optimistic, intentional student leader)! I’m excited to be running for Student Government because I’m passionate about leadership, advocating for my peers, and bringing about positive change. I hope to build a culture where all students feel safe, seen, and valued. I’d like to see our class leave a legacy of unity and connectedness – where students with diverse backgrounds and beliefs come together to celebrate each other’s successes and support each other during challenging times. As a South African, I’m excited to help represent Penn’s international students, but most importantly, Penn’s broader student body. ",
                "platform_points": [
                    "Important but attainable goals! From previous leadership experience, I understand how frustrating implementing systemic change can be. So, as a student leader, I will work to bring real, positive change. ",
                    "Transparency from student government! It’s important for all students to be involved in our plans. I will ensure that students are informed about upcoming events and ongoing projects.",
                    "Highlighting you! Your efforts, achievements, and contributions deserve to be recognized. I will work to create a digital newsletter that celebrates your successes.",
                    "Advocating for Affordability! I want to help students live as affordably as they can at Penn by saving money on textbooks and food and learning to utilize their financial aid.",
                    "Amplifying your voice! Ultimately, my job will be to represent your issues and ideas. So, I will make myself available and serve as a bridge between students and administration.",
                    "Fostering social cohesion and connection! I’m excited to help organize social events and initiatives to make our first year at Penn a memorable one."
                ]
            },
            {
                "name": "Chinmay Deshmukh",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:chinmayd@sas.upenn.edu",
                "introduction": "Deshmukh, He'll Cook! From Econ Scream to Spring Fling and everything in between, as the VP of External Affairs, my assurance is that our freshman year will. Be. Lit.  I’m a go-getter. A mountain climber (I literally climbed the Himalayas). A shot taker. But most importantly, I’m one of you: Another Quaker. Let’s get to the details. I’m a Florida Man with a plan to bring us to the promised land (Top 5 on US News). I’m running to give you a voice--From Hill to Dubois.",
                "platform_points": [
                    "I will provide universal free printing. Currently, only Wharton students get a $40 stipend for printing. I hope to expand this to all schools.",
                    "I will Increase access to free contraception on campus. As provided by other universities, I would install vending machines that dispense such products through PennCard access.",
                    "I will create a centralized event calendar that serves as a reminder of important campus events.",
                    "I will work with the career development center to provide freshman-only resources(internships & opportunities).",
                    "I will expand wifi bandwidth in residence halls and study lounges.",
                    "I will institute a direct mentorship program for all students. Each freshman will be paired with an upperclassman who shares their interests and will provide guidance throughout the first year."
                ]
            },
            {
                "name": "Leo Ding",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:leoding@sas.upenn.edu",
                "introduction": "What's up! My name is Leo Ding and I’m running to be your next VP of Internal. I have qualifications for this appointment. I can fold a fitted sheet. I can watch six episodes of a show without moving my feet. And most importantly, I can find the remote in between the couch seats.   Also know that I’m highly regarded by peers. In fact here are some true quotes from friends:  Noah Bauer says, “He is truly the most beautiful man alive.” Ashwin Ranjan deliberates, saying “I, personally, would carry his kids.” Hudson Barry notes, “Leo is equivalent to Pope Francis.”",
                "platform_points": [
                    "On-campus Philly FREE Food Festival",
                    "Class of 2028 Theme Merch",
                    "Schoolwide Cash Poker Tournament",
                    "Downtown Pool Party",
                    "Vote Leo DING, Ur KING for VP of Internal."
                ]
            },
            {
                "name": "Joel Wang",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:joelwang@wharton.upenn.edu",
                "introduction": "Hi, I’m Joel Wang, and I’m running for President of the ’28 Class Board. I’m from Hutchinson, Minnesota and I'm studying Economics and Finance at Wharton.  I’m running for the role of President because I’m all about making our time here unforgettable. I want us to have a blast with campus traditions, come together as a class, and take pride in being the Class of ’28. Whether it’s poker tournaments, big cookouts, or crazy class trips, it’s my goal to make sure we experience life-long memories that the Class of ’28 will talk about years after we graduate. ",
                "platform_points": [
                    "Food: Get fun food events on campus e.g. cookouts ",
                    "Merch: Create Class of ’28 swag that we actually want to wear ",
                    "Class Trips: Plan exciting trips to the beach, amusement parks...it’s all up to you",
                    "Tournaments: Host exciting tournaments and competitions e.g. poker, dodgeball",
                    "Polls: Regularly check in with polls to make sure your ideas drive our events",
                    "Study Breaks: Organize laid-back study breaks to help us unwind and hang out together"
                ]
            },
            {
                "name": "Rustin Kharrazi",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:rustink@sas.upenn.edu",
                "introduction": "TRUST IN RUSTIN to advocate, empower, and unite the Class of 2028 with energy and dedication! Join me in building a Penn community that uplifts each other—embracing diversity, collaboration, and meaningful change on campus. Hailing from Los Angeles, I am as bold as my Erewhon buffalo cauliflower and bright as a Malibu beach day. Together, we can strengthen our relationship with the administration and expand the resources we deserve, such as wellness and dining services. Quakers are destined for success, and I’m excited to help us get there!",
                "platform_points": [
                    "Increase support for student organizations, clubs, and initiatives that promote inclusivity and community building",
                    "Foster collaboration and overlap between schools through cross-school event-planning",
                    "Expand forums to voice student opinions and concerns through larger in-person advocacy events and updated online outlets",
                    "Create a supportive, interconnected Penn community through social events and cultural celebration"
                ]
            },
            {
                "name": "Mert Kayabas",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:mkayabas@sas.upenn.edu"
            },
            {
                "name": "Aidan Shaughnessy",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:aidansh@sas.upenn.edu",
                "introduction": "Hi! My name is Aidan Shaughnessy and I am from McLean, Virginia right outside of D.C. I am running for your VP of Internal Affairs and New Student Representative in the Undergraduate Assembly. I’m determined to make freshman year unforgettable through more class-wide events, stress-less policies, and strong accountability for our student government. Having served as class president in high-school and advocated for educational policies with my work in youth activism, I have both the passion and experience to represent our student voices. The choice is simple: Aidan is to your aid!",
                "platform_points": [
                    "Building more tradition through student-input when planning class events. Through class-wide polls and feedback forms, we can create actual fun, unique events – something special just for the class of 2028.",
                    "More free food and drinks just for freshmen. Let’s put the student government budget to use through regular snack tables, coffee catering, and more at residential houses and on Locust.",
                    "More holiday-themed events for freshmen. Whether a trick-or-treat night in the Quad or a giant Christmas party at Hill, I want our class to feel connected.",
                    "Holding our class board accountable. Managing internal affairs on the class board, I want to ensure that there are no more empty promises made in student government.",
                    "Increasing academic support for first-year courses. Struggling students should be able to find more laid-back, fun resources, such as big-little programs or honest Q&A sessions that are lowkey and low-commitment."
                ]
            },
            {
                "name": "Achille Giaretta",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:giaretta@sas.upenn.edu"
            },
            {
                "name": "Aditya Bala",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:adibala@sas.upenn.edu"
            },
            {
                "name": "Tanvi Deshmukh",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:tanvid@sas.upenn.edu",
                "introduction": "Class of 2028, ARE YOU READY?! I'm Tanvi Deshmukh, studying physics in CAS. I’m committed to helping Quakers thrive, whether helping with math homework, implementing your ideas on campus, or being a shoulder to lean on. My high school didn’t have a library, so as class president, I built our first one with just empty room, book drives, and a dream. I’ll continue this innovative spirit as your Class Board President. If you remember one thing about this campaign, remember I’m about putting students first and making change together. Because this is a campaign of change—change for YOU. #tanvi4me",
                "platform_points": [
                    "Merch Collabs with Brands and Musical Artists More than Lululemon and Columbia Sportswear…Stussy, Gymshark, Ralph Lauren, Essentials; Snag CharlieXCX/Kendrick x Penn merch; and Pop-up giveaways and raffles.",
                    "College House Capture the Flag: On-campus twist to a competitive classic... Which college house can retrieve the most flags from other dorms by the end of the week? ",
                    "24/7 Accessible Coffee Machines, Microwaves, and Printers in Every College House",
                    "Increased hours of operation in Pottruck and midnight snacks in Dining Halls",
                    "Dedicated Pickleball Courts: It’s the fastest-growing sport of America in 2024, but Penn’s campus has no dedicated courts? Let’s change that.",
                    "More Solo Study Pods in Towne, DRLB, Fisher-Bennett, and College Houses"
                ]
            },
            {
                "name": "Megan Chan",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:mganchan@sas.upenn.edu",
                "introduction": "Hi everyone!! My name is Megan Chan, and I am running for the VP of finance. I am passionate about creating a memorable first year and welcoming environment for the class of 2028. Through planning traditions and events, hosting food events, and, hopefully, designing some new merch, I hope to get to know my classmates even more, listening to their feedback and integrating their advice. With the stress that comes with college, I want to make our time at Penn the most enjoyable it can be while strengthening our class unity and spirit. ",
                "platform_points": [
                    "Continue the current traditions and create more class bonding activities, like “Winter Week,” which is in December before finals where there are daily food events and activities offered on Locust ",
                    "Create new merch for our grade!! Sweatshirts, quarter zips, sweatpants, pajama pants, or more",
                    "Highlight wellness resources and launch campaigns that promote the available campus services, whether this be for physical, mental, or other health issues",
                    "Improve communication between class board, students, administration, and staff – either through newsletters, interactive forum where students can voice concerns, suggestions, and opinions, or social media "
                ]
            },
            {
                "name": "Mehek Aggarwal",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:mehekagg@sas.upenn.edu",
                "introduction": "Hi! Born in New York, I’ve spent most of my life in Mumbai, India. At Penn, I’m focused on Economics and Cinema & Media Studies.   I love travelling, meeting new people and working in teams! I thrive on impacting meaningful change whether through my social work with refugees and underprivileged children or by making practical improvements at my high school as a student government member. I’m a good listener and always eager to help- so feel free to reach out!  I hope to be elected as your SAS Chair on the Class Board and positively impact our shared community!",
                "platform_points": [
                    "Promote pursuing the Arts at Penn: I hope to organize networking events and more clubs to encourage the expansion of the Arts & Language Majors in the college ",
                    "Encourage celebrating cultures at Penn: Along with increasing interactions with cultural houses, I will organize more cultural events for various belief systems to make students feel more at home",
                    "Pooling System: To help freshmen make friends and for possible first-time travelers- I'll create an interface that connects students travelling to similar destinations allowing them to find travel buddies",
                    "Initiate Fortnightly Recreational Activities: To allow students a break from heavy workloads and other stress, I’ll organize events like laser tag, mini golf and animal therapy on the weekends",
                    "Improve hygiene in College Houses: In addition to putting signs encouraging hygienic use of communal bathrooms, I’ll push for disposable toilet seat covers and supply of menstrual products ",
                    "Encourage Composting: To treat the waste from the dining halls better, I'll encourage placing composting boxes to improve sustainability"
                ]
            }
        ]
    },
    {
        "category": "Class Board President",
        "people": [
            {
                "name": "Mert Kayabas",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:mkayabas@sas.upenn.edu"
            },
            {
                "name": "Joel Wang",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:joelwang@wharton.upenn.edu",
                "introduction": "Hi, I’m Joel Wang, and I’m running for President of the ’28 Class Board. I’m from Hutchinson, Minnesota and I'm studying Economics and Finance at Wharton.  I’m running for the role of President because I’m all about making our time here unforgettable. I want us to have a blast with campus traditions, come together as a class, and take pride in being the Class of ’28. Whether it’s poker tournaments, big cookouts, or crazy class trips, it’s my goal to make sure we experience life-long memories that the Class of ’28 will talk about years after we graduate. ",
                "platform_points": [
                    "Food: Get fun food events on campus e.g. cookouts ",
                    "Merch: Create Class of ’28 swag that we actually want to wear ",
                    "Class Trips: Plan exciting trips to the beach, amusement parks...it’s all up to you",
                    "Tournaments: Host exciting tournaments and competitions e.g. poker, dodgeball",
                    "Polls: Regularly check in with polls to make sure your ideas drive our events",
                    "Study Breaks: Organize laid-back study breaks to help us unwind and hang out together"
                ]
            },
            {
                "name": "Tanvi Deshmukh",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:tanvid@sas.upenn.edu",
                "introduction": "Class of 2028, ARE YOU READY?! I'm Tanvi Deshmukh, studying physics in CAS. I’m committed to helping Quakers thrive, whether helping with math homework, implementing your ideas on campus, or being a shoulder to lean on. My high school didn’t have a library, so as class president, I built our first one with just empty room, book drives, and a dream. I’ll continue this innovative spirit as your Class Board President. If you remember one thing about this campaign, remember I’m about putting students first and making change together. Because this is a campaign of change—change for YOU. #tanvi4me",
                "platform_points": [
                    "Merch Collabs with Brands and Musical Artists More than Lululemon and Columbia Sportswear…Stussy, Gymshark, Ralph Lauren, Essentials; Snag CharlieXCX/Kendrick x Penn merch; and Pop-up giveaways and raffles.",
                    "College House Capture the Flag: On-campus twist to a competitive classic... Which college house can retrieve the most flags from other dorms by the end of the week? ",
                    "24/7 Accessible Coffee Machines, Microwaves, and Printers in Every College House",
                    "Increased hours of operation in Pottruck and midnight snacks in Dining Halls",
                    "Dedicated Pickleball Courts: It’s the fastest-growing sport of America in 2024, but Penn’s campus has no dedicated courts? Let’s change that.",
                    "More Solo Study Pods in Towne, DRLB, Fisher-Bennett, and College Houses"
                ]
            },
            {
                "name": "Jose Carlos Serrano",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:joseserr@sas.upenn.edu"
            },
            {
                "name": "Brad Ferdinand",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:bradf@sas.upenn.edu",
                "introduction": "Hey, my name is Brad Ferdinand, I'm from Philly, and I'm running to be your Class Board President and New Student Representative. I'm running for Class Board President and the New Student Representative roles, as I firmly believe I would be able to represent and actually have our voices heard within the Penn Community. From food quality issues at the dinings halls, to sanitary issues in the dorms, and even the scale and potential fun had at campus wide events. I want to assure you that a vote for me, would be a vote for tangible results. ",
                "platform_points": [
                    "Incentivize better food quality at dining halls and sanitary standards through potential paid/non paid benefits for workers using UA funds",
                    "Establish large scale events with ties to Philadelphia’s cultural significance on Campus, with multiple interactive activities for students to involve themselves with ",
                    "Establish 'town halls' with Penn administration for all students to have the option to come to, in an attempt to facilitate more transparency between the administration and students",
                    "Partner with other restaurants and companies to allow our dining dollars to work at more locations, such as Chipotle, Raising Canes, and even Drexel affiliated restaurants.",
                    "Work with Administration to partner with local Food Donation organizations to sue access dining hall foods to feed people in need"
                ]
            }
        ]
    },
    {
        "category": "Class Board Executive Vice President",
        "people": [
            {
                "name": "Khushi Patil",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:kpatil5@sas.upenn.edu",
                "introduction": "Hi everyone! My name is Khushi Patil and I'm a current freshman at Penn. I am excited to announce my candidacy for the position of Executive Vice President for the Class of 2028. Here are a few things about me: I am a tennis player, leader and advocate, big sister, kind and supportive friend, and a hard worker. I am running for Executive Vice President because of my undeniable love for helping people; public service is one of my biggest strengths, and I look forward to channeling this passion to make our time at Penn as memorable as possible.",
                "platform_points": [
                    "I will be a shoulder for you all to lean on. I am here to listen, support, encourage, and help in any way that I can.",
                    "I plan on creating and hosting fun and memorable events that become new traditions for future classes, both campus wide and in the beautiful city of Philadelphia. ",
                    "I hope to collaborate with local businesses and organizations to increase community engagement and help Penn students explore the broader Philadelphia Community.",
                    "I hope to launch fitness challenges to make sure that amidst all of the time we put into school, we are actively taking care of ourselves both physically and emotionally.",
                    "I aim to organize a class trip at the end of the year alongside my fellow officers to celebrate the end to a wonderful first year.",
                    "My platform is your platform. I am open to any suggestions that any of my fellow classmates have and will take them all into consideration! "
                ]
            },
            {
                "name": "Renny Huang",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:rennyh@wharton.upenn.edu"
            },
            {
                "name": "Edward Mukalazi",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:eddiemuk@sas.upenn.edu"
            },
            {
                "name": "Denzel Perez",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:denzelp@sas.upenn.edu",
                "introduction": "Hello, I’m Denzel Perez, originally from the Dominican Republic and now living in New York. I’m running for the UPenn Class Board because I’m passionate about creating a vibrant, inclusive community where every student feels heard and valued. My diverse background has taught me the importance of representation and collaboration, and I’m committed to bringing these values to our campus. With your support, I aim to enhance communication, advocate for student needs, and foster an environment where we all thrive together. Let’s make our time at UPenn unforgettable and impactful!",
                "platform_points": [
                    "Support initiatives that promote mental health awareness, provide resources, and create a more supportive environment for students dealing with stress and other challenges.",
                    "Being a voice for all students, ensuring that diverse perspectives are considered in decision-making and that student needs and concerns are addressed.",
                    "Address any concerns about campus facilities or services and work towards improvements that enhance the overall student experience, such as better study spaces, more recreational areas, or updated technology.",
                    "Improve communication between students and the board through regular updates, feedback sessions, and more accessible channels for suggestions and concerns.",
                    "Focus on creating opportunities for students to connect and build a sense of community through social events, networking opportunities, and collaborative projects.",
                    "Advocate for a diverse range of events that cater to different interests and backgrounds, ensuring that all students feel represented and included."
                ]
            }
        ]
    },
    {
        "category": "Class Board VP: External",
        "people": [
            {
                "name": "Rustin Kharrazi",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:rustink@sas.upenn.edu",
                "introduction": "TRUST IN RUSTIN to advocate, empower, and unite the Class of 2028 with energy and dedication! Join me in building a Penn community that uplifts each other—embracing diversity, collaboration, and meaningful change on campus. Hailing from Los Angeles, I am as bold as my Erewhon buffalo cauliflower and bright as a Malibu beach day. Together, we can strengthen our relationship with the administration and expand the resources we deserve, such as wellness and dining services. Quakers are destined for success, and I’m excited to help us get there!",
                "platform_points": [
                    "Increase support for student organizations, clubs, and initiatives that promote inclusivity and community building",
                    "Foster collaboration and overlap between schools through cross-school event-planning",
                    "Expand forums to voice student opinions and concerns through larger in-person advocacy events and updated online outlets",
                    "Create a supportive, interconnected Penn community through social events and cultural celebration"
                ]
            },
            {
                "name": "Chinmay Deshmukh",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:chinmayd@sas.upenn.edu",
                "introduction": "Deshmukh, He'll Cook! From Econ Scream to Spring Fling and everything in between, as the VP of External Affairs, my assurance is that our freshman year will. Be. Lit.  I’m a go-getter. A mountain climber (I literally climbed the Himalayas). A shot taker. But most importantly, I’m one of you: Another Quaker. Let’s get to the details. I’m a Florida Man with a plan to bring us to the promised land (Top 5 on US News). I’m running to give you a voice--From Hill to Dubois.",
                "platform_points": [
                    "I will provide universal free printing. Currently, only Wharton students get a $40 stipend for printing. I hope to expand this to all schools.",
                    "I will Increase access to free contraception on campus. As provided by other universities, I would install vending machines that dispense such products through PennCard access.",
                    "I will create a centralized event calendar that serves as a reminder of important campus events.",
                    "I will work with the career development center to provide freshman-only resources(internships & opportunities).",
                    "I will expand wifi bandwidth in residence halls and study lounges.",
                    "I will institute a direct mentorship program for all students. Each freshman will be paired with an upperclassman who shares their interests and will provide guidance throughout the first year."
                ]
            }
        ]
    },
    {
        "category": "Class Board VP: Internal",
        "people": [
            {
                "name": "Taya Allardice",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:alltaya@sas.upenn.edu",
                "introduction": "I’m Taya (hopefully your next optimistic, intentional student leader)! I’m excited to be running for Student Government because I’m passionate about leadership, advocating for my peers, and bringing about positive change. I hope to build a culture where all students feel safe, seen, and valued. I’d like to see our class leave a legacy of unity and connectedness – where students with diverse backgrounds and beliefs come together to celebrate each other’s successes and support each other during challenging times. As a South African, I’m excited to help represent Penn’s international students, but most importantly, Penn’s broader student body. ",
                "platform_points": [
                    "Important but attainable goals! From previous leadership experience, I understand how frustrating implementing systemic change can be. So, as a student leader, I will work to bring real, positive change. ",
                    "Transparency from student government! It’s important for all students to be involved in our plans. I will ensure that students are informed about upcoming events and ongoing projects.",
                    "Highlighting you! Your efforts, achievements, and contributions deserve to be recognized. I will work to create a digital newsletter that celebrates your successes.",
                    "Advocating for Affordability! I want to help students live as affordably as they can at Penn by saving money on textbooks and food and learning to utilize their financial aid.",
                    "Amplifying your voice! Ultimately, my job will be to represent your issues and ideas. So, I will make myself available and serve as a bridge between students and administration.",
                    "Fostering social cohesion and connection! I’m excited to help organize social events and initiatives to make our first year at Penn a memorable one."
                ]
            },
            {
                "name": "Maxwell Robinson",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:maxrob@sas.upenn.edu",
                "introduction": "Hello! My name is Max Robinson, and I’m running to be your Undergraduate Assembly New Student Representative and Class Board Internal Vice President. I’m originally from London, but now live in New York. It’s been so great meeting so many of you and can’t wait to meet everyone else! As my high school's Executive Board Vice President, I led initiatives like installing solar panels on my school, hosting a TEDx conference, and creating permanent diversity, philanthropy, and advocacy boards. If elected, I’ll bring big, lasting changes here, just like I did before. I hope to earn your vote! Thank you!",
                "platform_points": [
                    "I’m here to support you and your ideas. While I have my own, your voice comes first. I promise to listen, ensuring your wishes shape the change we bring together.",
                    "Last year, I led efforts to bring my high school’s first-ever Class Gift. I’ll work to leave one of the most significant gifts ever, creating a lasting legacy for us.",
                    "At my high school, I worked successfully with students, administration, and the broader community to drive change. I’ll foster the same cooperation here to create meaningful, lasting impact for everyone.",
                    "I successfully brought over 100 solar panels to my high school. I’ll leverage those connections to bring similar sustainability initiatives to Penn, helping make our campus greener and more sustainable.",
                    "I established permanent diversity, philanthropy, and outreach boards at my high school. I promise to create similar boards here, ensuring they positively impact Penn, just as they transformed my school.",
                    "I brought food trucks, celebrity DJs, and innovative events to my school. I love having fun, and would be so happy to bring exciting, new, and inclusive events for everyone."
                ]
            },
            {
                "name": "Leo Ding",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:leoding@sas.upenn.edu",
                "introduction": "What's up! My name is Leo Ding and I’m running to be your next VP of Internal. I have qualifications for this appointment. I can fold a fitted sheet. I can watch six episodes of a show without moving my feet. And most importantly, I can find the remote in between the couch seats.   Also know that I’m highly regarded by peers. In fact here are some true quotes from friends:  Noah Bauer says, “He is truly the most beautiful man alive.” Ashwin Ranjan deliberates, saying “I, personally, would carry his kids.” Hudson Barry notes, “Leo is equivalent to Pope Francis.”",
                "platform_points": [
                    "On-campus Philly FREE Food Festival",
                    "Class of 2028 Theme Merch",
                    "Schoolwide Cash Poker Tournament",
                    "Downtown Pool Party",
                    "Vote Leo DING, Ur KING for VP of Internal."
                ]
            },
            {
                "name": "Cole Pryor",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:pryorc@sas.upenn.edu",
                "introduction": "Hey! My name is Cole Pryor and I'm running for Vice-President of Internal Affairs. I'm not going to waste your time or try to deceive you, so here are the facts: if you like what I have to say, you're welcome to vote for me (just ignore the fact that I'm from New Jersey). If not, I encourage you to vote for someone else. If you see me around, feel free to say hi, I'll likely be wearing sunglasses.",
                "platform_points": [
                    "I promise to hold referendums when reasonable, giving a voice to the people.",
                    "I will get funds allocated to port-a-potties near the Ben Franklin bench, because apparently bathroom demand is high around there. ",
                    "Everyone has something valuable to share, so I will help organize events (football watch parties, trips to Center City, etc.) where people from all four colleges can make friends with one another. ",
                    "I will consult with my sources at USNews to see if we can get Penn ranked higher than Princeton by the end of my term.",
                    "I will collaborate with Penn Labs to organize a platform where we can efficiently switch classes/recitations with one another when applicable.",
                    "I will lift the curse of the compass, allowing you to step on it without failing your midterm. "
                ]
            },
            {
                "name": "Aidan Shaughnessy",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:aidansh@sas.upenn.edu",
                "introduction": "Hi! My name is Aidan Shaughnessy and I am from McLean, Virginia right outside of D.C. I am running for your VP of Internal Affairs and New Student Representative in the Undergraduate Assembly. I’m determined to make freshman year unforgettable through more class-wide events, stress-less policies, and strong accountability for our student government. Having served as class president in high-school and advocated for educational policies with my work in youth activism, I have both the passion and experience to represent our student voices. The choice is simple: Aidan is to your aid!",
                "platform_points": [
                    "Building more tradition through student-input when planning class events. Through class-wide polls and feedback forms, we can create actual fun, unique events – something special just for the class of 2028.",
                    "More free food and drinks just for freshmen. Let’s put the student government budget to use through regular snack tables, coffee catering, and more at residential houses and on Locust.",
                    "More holiday-themed events for freshmen. Whether a trick-or-treat night in the Quad or a giant Christmas party at Hill, I want our class to feel connected.",
                    "Holding our class board accountable. Managing internal affairs on the class board, I want to ensure that there are no more empty promises made in student government.",
                    "Increasing academic support for first-year courses. Struggling students should be able to find more laid-back, fun resources, such as big-little programs or honest Q&A sessions that are lowkey and low-commitment."
                ]
            }
        ]
    },
    {
        "category": "Class Board VP: Finance",
        "people": [
            {
                "name": "Eva Zheberlyaeva",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:evaz28@wharton.upenn.edu"
            },
            {
                "name": "Megan Chan",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:mganchan@sas.upenn.edu",
                "introduction": "Hi everyone!! My name is Megan Chan, and I am running for the VP of finance. I am passionate about creating a memorable first year and welcoming environment for the class of 2028. Through planning traditions and events, hosting food events, and, hopefully, designing some new merch, I hope to get to know my classmates even more, listening to their feedback and integrating their advice. With the stress that comes with college, I want to make our time at Penn the most enjoyable it can be while strengthening our class unity and spirit. ",
                "platform_points": [
                    "Continue the current traditions and create more class bonding activities, like “Winter Week,” which is in December before finals where there are daily food events and activities offered on Locust ",
                    "Create new merch for our grade!! Sweatshirts, quarter zips, sweatpants, pajama pants, or more",
                    "Highlight wellness resources and launch campaigns that promote the available campus services, whether this be for physical, mental, or other health issues",
                    "Improve communication between class board, students, administration, and staff – either through newsletters, interactive forum where students can voice concerns, suggestions, and opinions, or social media "
                ]
            }
        ]
    },
    {
        "category": "Class Board College Class Chair",
        "people": [
            {
                "name": "Alejandra Picon",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:alepicon@sas.upenn.edu",
                "introduction": "Hello everyone! My name is Alejandra Picon, a freshman from the College, and I am running for a seat as SAS Class Chair in the Class Board of 2028. I am devoted to representing the College of Arts and Sciences and to uphold school spirit within the class. As SAS Class Chair, I look to uphold Penn traditions and commit to fostering an inclusive community for all.",
                "platform_points": [
                    "I will make it a goal to advocate for mental health resources and to create a space where everyone feels seen and heard. ",
                    "I plan to organize events that will enhance and uphold school spirit for the College of Arts and Sciences.",
                    "I will aim to establish an inclusive and engaging community within the Class of 2028 that will last beyond Penn. "
                ]
            },
            {
                "name": "Annabel Shic",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:ashic@sas.upenn.edu",
                "introduction": "My name is Annabel Shic, your candidate for College Chair. As a CAS Chair, I have goals to create a more inclusive club culture, offer free printing in every college house, and make career opportunities more accessible. But ultimately, my goal is to create relationships that connect us all with each other. Whether you’re outgoing or reserved, bold or soft-spoken, your voice matters, and your story deserves to be heard. I am dedicated to elevating YOUR voice. I care about you. And, I cannot wait to see where our collaboration will take us. Vote for me–I get shic done.",
                "platform_points": [
                    "Inclusivity: Club applications shouldn’t be so stressful! Shape an inclusive and welcoming club culture by mandating club information be posted online in a centralized location. Create a standardized application for each category of club.",
                    "Accessible printing:  Bring free printing services to every college house and library.",
                    "Dining hall: More toasters and omlet bars in each dining hall, Ensure that every table has salt and pepper regularly stocked, as well as the condiments section",
                    "Coffee and career:  Create a online platform to organize and schedule coffee chats with Penn alumni. Coffee machines to be placed in every academic building.",
                    "Embracing diversity:  Uplift the voices of affinity groups by providing a platform to share current world events, frequently meeting with them, and connecting them with faculty.",
                    "Your voice:  Ensure every student’s voice is heard by maintaining open and ongoing communication with the student council committee."
                ]
            },
            {
                "name": "Mehek Aggarwal",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:mehekagg@sas.upenn.edu",
                "introduction": "Hi! Born in New York, I’ve spent most of my life in Mumbai, India. At Penn, I’m focused on Economics and Cinema & Media Studies.   I love travelling, meeting new people and working in teams! I thrive on impacting meaningful change whether through my social work with refugees and underprivileged children or by making practical improvements at my high school as a student government member. I’m a good listener and always eager to help- so feel free to reach out!  I hope to be elected as your SAS Chair on the Class Board and positively impact our shared community!",
                "platform_points": [
                    "Promote pursuing the Arts at Penn: I hope to organize networking events and more clubs to encourage the expansion of the Arts & Language Majors in the college ",
                    "Encourage celebrating cultures at Penn: Along with increasing interactions with cultural houses, I will organize more cultural events for various belief systems to make students feel more at home",
                    "Pooling System: To help freshmen make friends and for possible first-time travelers- I'll create an interface that connects students travelling to similar destinations allowing them to find travel buddies",
                    "Initiate Fortnightly Recreational Activities: To allow students a break from heavy workloads and other stress, I’ll organize events like laser tag, mini golf and animal therapy on the weekends",
                    "Improve hygiene in College Houses: In addition to putting signs encouraging hygienic use of communal bathrooms, I’ll push for disposable toilet seat covers and supply of menstrual products ",
                    "Encourage Composting: To treat the waste from the dining halls better, I'll encourage placing composting boxes to improve sustainability"
                ]
            }
        ]
    },
    {
        "category": "Class Board Engineering Class Chair",
        "people": [
            {
                "name": "Grace Chi",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:gracechi@seas.upenn.edu",
                "introduction": "Hi everyone! I’m Grace Chi, and I’m running for the SEAS Class Chair for Class Board 2028! As an Artificial Intelligence major with a Blank Space full of ideas, I’m passionate about organizing enjoyable and connecting events that will never go out of style. Whether it’s planning the best events (because, let’s be honest, I plan them All Too Well), or being your Fearless representative for the members of our engineering school, I’ll work tirelessly to make this year an Enchanted experience. Let’s make our Penn journey a Love Story to remember, and together we’ll make Sparks Fly! ",
                "platform_points": [
                    "Plan seamless and genuinely enjoyable events for the Class of 2028 ",
                    "Genuinely uplift all voices in the engineering community by advocating for underrepresented groups and their interests",
                    "Utilize environmentally sustainable processes at all events (ex. by reducing waste and promoting recycling)",
                    "Create inclusive and accessible event environments for all students",
                    "Ensure that communication is clear and transparent to maximize the enjoyability of the amazing traditions Penn has to offer",
                    "Build wonderful memories increase the connectedness of all Class of 2028 students!"
                ]
            },
            {
                "name": "Daniel Ranaudo",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:ranaudo@sas.upenn.edu",
                "introduction": "Hi! I’m Daniel Ranaudo, and I’m running for the Class of 2028 Engineering Chair. As engineers, we all know how crucial communication and collaboration are to our success. In this role, I’ll make it my priority to embody these values by actively listening to your needs and working hard to implement them. With your support, I’ll ensure that our class feels connected and proud, building a strong sense of community that brings us together.",
                "platform_points": [
                    "Fostering Connections: Implement activities (with free food!) that connect students of the same major, allowing for new friendships or study buddies.",
                    "Professional Development: Provide students with valuable resources that’ll give them opportunities to explore different career paths, or to focus on their dream careers. ",
                    "Co-collaboration: Work closely with other Class Boards to organize events that cater to the entire student body, creating class wide school spirit.",
                    "Student Spotlight: Create a student spotlight that showcases the successes of students, allowing us to celebrate and congratulate our peers for their hard work.",
                    "Student Feedback: Develop a forum where students can share and discuss their concerns and ideas to make sure they are being heard."
                ]
            }
        ]
    },
    {
        "category": "Class Board Wharton Class Chair",
        "people": [
            {
                "name": "Andreas Petropoulos",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:apetrops@wharton.upenn.edu",
                "introduction": "Hey everyone! I’m Andreas, a Wharton student concentrating in Finance and Management. Outside of class, you’ll find me playing guitar, boxing, or hanging out with friends—I love picking up new hobbies and connecting with people. I’m running for Wharton Chair to bring fresh ideas and make recruiting easier for freshmen. I’m excited to get to work on some fun events for our class!",
                "platform_points": [
                    "Actively listen and engage with students to ensure their concerns are heard and addressed.",
                    "Make recruiting easier for freshmen by providing helpful resources.",
                    "Organize fun events that bring our class together and build a stronger community.",
                    "Increase transparency by providing regular updates on board activities and decisions, keeping everyone informed and involved."
                ]
            }
        ]
    },
    {
        "category": "Class Board Nursing Class Chair",
        "people": [
            {
                "name": "Jeongmi Ahn",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:jmahn@nursing.upenn.edu",
                "introduction": "Hi! My name is Jeongmi Ahn, and I am running for Nursing Chair for the class of 2028. I am running for the class board to create events to showcase how mighty the Nursing class of 2028 can be! I can host events that are tailored to both academic and entertainment. I aim to bring fresh ideas that make student life better—from organizing fun events to improving resources that matter to you. I’m committed to listening to your needs and working together to make the first year of college the best time for us. Let’s make Nursing known at Penn!",
                "platform_points": [
                    "Match Event: Formal event where the class of 2028 nursing students match with upperclassmen to form friendly connections. Students will match based on their interests in nursing and hobbies.",
                    "Movie trip: Take a study break and bond with the class through a fun movie night! Popcorn and snacks will be provided, and students get to vote on the movie.",
                    "Study group sessions: Studying with your classmates can bring more ideas and clarify questions or concerns. From sharing notes to sharing pain, we’ll make it through together with study sessions.",
                    "Holiday events: Holidays are meant to be celebrated with others. Therefore, there will be fun holiday events, such as secret Santa, trick-or-treating, ugly sweater competitions, cookie decorating, and more! ",
                    "Field trip: Spend a fun day out on a class field trip! We will have a full day for adventurous activities and a break from academic stress. ",
                    "Bingo time: Win Penn merch and prizes through nursing bingo! Instead of picking out numbers, we will work in groups to answer questions and form their own bingo boards. "
                ]
            }
        ]
    },
    {
        "category": "UA Engineering Rep",
        "people": [
            {
                "name": "Paree Pasi",
                "image": "https://i.ibb.co/J2GFVvN/stand-in.png",
                "email": "mailto:ppasi@seas.upenn.edu"
            }
        ]
    }
]
